{
  "base_model_name_or_path": "TinyLlama/TinyLlama-1.1B-Chat-v0.1",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 16,
  "lora_dropout": 0.05,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "target_modules": [
    "q_proj"
  ],
  "task_type": "CAUSAL_LM"
}